GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Source/gd32a508_usart.c
        USART5_CTL1(usart_periph) &= ~(USART_CTL1_CLEN | USART_CTL1_CPH | USART_CTL1_CPL);
        USART5_CTL1(usart_periph) |= (USART_CTL1_CLEN & clen) | (USART_CTL1_CPH & cph) | (USART_CTL1_CPL & cpl);
    }else{       
        USART_CTL1(usart_periph) &= ~(USART_CTL1_CLEN | USART_CTL1_CPH | USART_CTL1_CPL);
        USART_CTL1(usart_periph) |= (USART_CTL1_CLEN & clen) | (USART_CTL1_CPH & cph) | (USART_CTL1_CPL & cpl);
    }
}

/*!
    \brief      configure guard time value in smartcard mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  guat: guard time value, 0x00000000-0x000000FF
    \param[out] none
    \retval     none
*/
void usart_guard_time_config(uint32_t usart_periph,uint8_t guat)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);

        USART5_GP(usart_periph) &= ~(USART5_GP_GUAT);
        /* configure USART5 guard time value */
        USART5_GP(usart_periph) |= (USART5_GP_GUAT & ((uint32_t)guat << GP_GUAT_OFFSET));
    }else{
        USART_GP(usart_periph) &= ~(USART_GP_GUAT);
        /* configure USARTx(x=0,1,2) guard time value */
        USART_GP(usart_periph) |= (USART_GP_GUAT & ((uint32_t)guat << GP_GUAT_OFFSET));
    }
}

/*!
    \brief      enable smartcard mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_smartcard_mode_enable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);

        /* enable USART5 smartcard mode */
        USART5_CTL2(usart_periph) |= USART5_CTL2_SCEN;
    }else{
        /* enable USARTx(x=0,1,2) smartcard mode */
        USART_CTL2(usart_periph) |= USART_CTL2_SCEN;
    }
}

/*!
    \brief      disable smartcard mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_smartcard_mode_disable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* disable USART5 smartcard mode */
        USART5_CTL2(usart_periph) &= ~(USART5_CTL2_SCEN);
    }else{
        /* disable USARTx(x=0,1,2) smartcard mode */
        USART_CTL2(usart_periph) &= ~(USART_CTL2_SCEN);
    }
}

/*!
    \brief      enable NACK in smartcard mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_smartcard_mode_nack_enable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* enable USART5 NACK in smartcard mode */
        USART5_CTL2(usart_periph) |= USART5_CTL2_NKEN;
    }else{
        /* enable USARTx(x=0,1,2) NACK in smartcard mode */
        USART_CTL2(usart_periph) |= USART_CTL2_NKEN;
    }
}

/*!
    \brief      disable NACK in smartcard mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_smartcard_mode_nack_disable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* disable USART5 NACK in smartcard mode */
        USART5_CTL2(usart_periph) &= ~(USART5_CTL2_NKEN);
    }else{
        /* disable USARTx(x=0,1,2) NACK in smartcard mode */
        USART_CTL2(usart_periph) &= ~(USART_CTL2_NKEN);
    }
}

/*!
    \brief      configure smartcard auto-retry number
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  scrtnum: smartcard auto-retry number, 0x00000000-0x00000007
    \param[out] none
    \retval     none
*/
void usart_smartcard_autoretry_config(uint32_t usart_periph, uint8_t scrtnum)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        
        USART5_CTL2(usart_periph) &= ~(USART5_CTL2_SCRTNUM);
        /* configure USART5 smartcard auto-retry number */
        USART5_CTL2(usart_periph) |= (USART5_CTL2_SCRTNUM & ((uint32_t) scrtnum << CTL2_SCRTNUM_OFFSET));
    }else{
        USART_CTL3(usart_periph) &= ~(USART_CTL3_SCRTNUM);
        /* configure USARTx(x=0,1,2) smartcard auto-retry number */
        USART_CTL3(usart_periph) |= (USART_CTL3_SCRTNUM & ((uint32_t)scrtnum << CTL3_SCRTNUM_OFFSET));
    }
}

/*!
    \brief      configure block length in Smartcard T=1 reception
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  bl: block length, 0x00000000-0x000000FF
    \param[out] none
    \retval     none
*/
void usart_block_length_config(uint32_t usart_periph, uint8_t bl)
{
    if(USART5 == usart_periph){
        USART5_RT(usart_periph) &= ~(USART5_RT_BL);
        /* configure USART5 block length */
        USART5_RT(usart_periph) |= (USART5_RT_BL & ((uint32_t)bl << RT_BL_OFFSET));
    }else{
        USART_RT(usart_periph) &= ~(USART_RT_BL);
        /* configure USARTx(x=0,1,2) block length */
        USART_RT(usart_periph) |= (USART_RT_BL & ((uint32_t)bl << RT_BL_OFFSET));
    }
}

/*!
    \brief      enable IrDA mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[out] none
    \retval     none
*/
void usart_irda_mode_enable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* enable USART5 IrDA mode */
        USART5_CTL2(usart_periph) |= USART5_CTL2_IREN;
    }else{
        /* enable USARTx(x=0,1,2)/UARTx(x=3,4) IrDA mode */
        USART_CTL2(usart_periph) |= USART_CTL2_IREN;
    }
}

/*!
    \brief      disable IrDA mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[out] none
    \retval     none
*/
void usart_irda_mode_disable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* disable USART5 IrDA mode */
        USART5_CTL2(usart_periph) &= ~(USART5_CTL2_IREN);
    }else{
        /* disable USARTx(x=0,1,2)/UARTx(x=3,4) IrDA mode */
        USART_CTL2(usart_periph) &= ~(USART_CTL2_IREN);
    }
}

/*!
    \brief      configure the peripheral clock prescaler in USART IrDA low-power mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[in]  psc: 0x00000000-0x000000FF
    \param[out] none
    \retval     none
*/
void usart_prescaler_config(uint32_t usart_periph, uint8_t psc)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        
        USART5_GP(usart_periph) &= ~(USART5_GP_PSC);
        /* configure the psc in USART5 */
        USART5_GP(usart_periph) |= (uint32_t)psc;
    }else{
        USART_GP(usart_periph) &= ~(USART_GP_PSC);
        /* configure the psc in USARTx(x=0,1,2)/UARTx(x=3,4) */
        USART_GP(usart_periph) |= (uint32_t)psc;
    }
}

/*!
    \brief      configure IrDA low-power
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[in]  irlp: IrDA low-power or normal
                only one parameter can be selected which is shown as below:
      \arg        USART_IRLP_LOW: low-power
      \arg        USART_IRLP_NORMAL: normal
    \param[out] none
    \retval     none
*/
void usart_irda_lowpower_config(uint32_t usart_periph, uint32_t irlp)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        
