GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Source/gd32a508_usart.c
    USART5_CTL2(usart_periph) |= USART5_CTL2_DDRE;
}

/*!
    \brief      enable USART to wakeup the mcu from deep-sleep mode
    \param[in]  usart_periph: USART5
    \param[out] none
    \retval     none
*/
void usart5_wakeup_enable(uint32_t usart_periph)
{
    USART5_CTL0(usart_periph) |= USART5_CTL0_UESM;
}

/*!
    \brief      disable USART to wakeup the mcu from deep-sleep mode
    \param[in]  usart_periph: USART5
    \param[out] none
    \retval     none
*/
void usart5_wakeup_disable(uint32_t usart_periph)
{
    USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UESM);
}

/*!
    \brief      configure the USART wakeup mode from deep-sleep mode
    \param[in]  usart_periph: USART5
    \param[in]  wum: wakeup mode
                only one parameter can be selected which is shown as below:
      \arg        USART5_WUM_ADDR: WUF active on address match
      \arg        USART5_WUM_STARTB: WUF active on start bit
      \arg        USART5_WUM_RBNE: WUF active on RBNE
    \param[out] none
    \retval     none
*/
void usart5_wakeup_mode_config(uint32_t usart_periph, uint32_t wum)
{
    /* disable USART5 */
    USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
    /* reset WUM bit */
    USART5_CTL2(usart_periph) &= ~(USART5_CTL2_WUM);
    USART5_CTL2(usart_periph) |= (USART5_CTL2_WUM & wum);
}

/*!
    \brief      enable receive FIFO
    \param[in]  usart_periph: USART5
    \param[out] none
    \retval     none
*/
void usart5_receive_fifo_enable(uint32_t usart_periph)
{
    USART5_RFCS(usart_periph) |= USART5_RFCS_RFEN;
}

/*!
    \brief      disable receive FIFO
    \param[in]  usart_periph: USART5
    \param[out] none
    \retval     none
*/
void usart5_receive_fifo_disable(uint32_t usart_periph)
{
    USART5_RFCS(usart_periph) &= ~(USART5_RFCS_RFEN);
}

/*!
    \brief      read receive FIFO counter number
    \param[in]  usart_periph: USART5
    \param[out] none
    \retval     receive FIFO counter number
*/
uint8_t usart5_receive_fifo_counter_number(uint32_t usart_periph)
{
    return (uint8_t)(GET_BITS(USART5_RFCS(usart_periph), 12U, 14U));
}

/*!
    \brief      get flag in STAT/CHC/RFCS register
    \param[in]  usart_periph: USART5
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        USART5_FLAG_PERR: parity error flag
      \arg        USART5_FLAG_FERR: frame error flag
      \arg        USART5_FLAG_NERR: noise error flag
      \arg        USART5_FLAG_ORERR: overrun error
      \arg        USART5_FLAG_IDLE: idle line detected flag
      \arg        USART5_FLAG_RBNE: read data buffer not empty
      \arg        USART5_FLAG_TC: transmission completed
      \arg        USART5_FLAG_TBE: transmit data register empty
      \arg        USART5_FLAG_LBD: LIN break detected flag
      \arg        USART5_FLAG_RT: receiver timeout flag
      \arg        USART5_FLAG_EB: end of block flag
      \arg        USART5_FLAG_BSY: busy flag
      \arg        USART5_FLAG_AM: address match flag
      \arg        USART5_FLAG_SB: send break flag
      \arg        USART5_FLAG_RWU: receiver wakeup from mute mode.
      \arg        USART5_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART5_FLAG_TEA: transmit enable acknowledge flag
      \arg        USART5_FLAG_REA: receive enable acknowledge flag 
      \arg        USART5_FLAG_EPERR: early parity error flag
      \arg        USART5_FLAG_RFE: receive FIFO empty flag
      \arg        USART5_FLAG_RFF: receive FIFO full flag
      \arg        USART5_FLAG_RFFINT: receive FIFO full interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus usart5_flag_get(uint32_t usart_periph, usart5_flag_enum flag)
{
    if(RESET != (USART_REG_VAL(usart_periph, flag) & BIT(USART_BIT_POS(flag)))){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear USART status
    \param[in]  usart_periph: USART5
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        USART5_FLAG_PERR: parity error flag
      \arg        USART5_FLAG_FERR: frame error flag
      \arg        USART5_FLAG_NERR: noise detected flag
      \arg        USART5_FLAG_ORERR: overrun error flag
      \arg        USART5_FLAG_IDLE: idle line detected flag
      \arg        USART5_FLAG_TC: transmission complete flag
      \arg        USART5_FLAG_LBD: LIN break detected flag
      \arg        USART5_FLAG_RT: receiver timeout flag
      \arg        USART5_FLAG_EB: end of block flag
      \arg        USART5_FLAG_AM: address match flag
      \arg        USART5_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART5_FLAG_EPERR: early parity error flag
    \param[out] none
    \retval     none
*/
void usart5_flag_clear(uint32_t usart_periph, usart5_flag_enum flag)
{
    USART5_INTC(usart_periph) |= BIT(USART_BIT_POS(flag));
}

/*!
    \brief      enable USART interrupt
    \param[in]  usart_periph: USART5
    \param[in]  interrupt: USART5 interrupts, refer to usart5_interrupt_enum
                only one parameter can be selected which is shown as below:
      \arg        USART5_INT_IDLE: idle interrupt
      \arg        USART5_INT_RBNE: read data buffer not empty interrupt and
                                  overrun error interrupt enable interrupt
      \arg        USART5_INT_TC: transmission complete interrupt
      \arg        USART5_INT_TBE: transmit data register empty interrupt
      \arg        USART5_INT_PERR: parity error interrupt
      \arg        USART5_INT_AM: address match interrupt
      \arg        USART5_INT_RT: receiver timeout interrupt
      \arg        USART5_INT_EB: end of block interrupt
      \arg        USART5_INT_LBD: LIN break detection interrupt
      \arg        USART5_INT_ERR: error interrupt enable in multibuffer communication
      \arg        USART5_INT_WU: wakeup from deep-sleep mode interrupt
      \arg        USART5_INT_RFF: receive FIFO full interrupt enable
    \param[out] none
    \retval     none
*/
void usart5_interrupt_enable(uint32_t usart_periph, usart5_interrupt_enum interrupt)
{
    USART_REG_VAL(usart_periph, interrupt) |= BIT(USART_BIT_POS(interrupt));
}

/*!
    \brief      disable USART interrupt
    \param[in]  usart_periph: USART5
    \param[in]  interrupt: USART5 interrupts, refer to usart5_interrupt_enum
                only one parameter can be selected which is shown as below:
      \arg        USART5_INT_IDLE: idle interrupt
      \arg        USART5_INT_RBNE: read data buffer not empty interrupt and
                                  overrun error interrupt
      \arg        USART5_INT_TC: transmission complete interrupt
      \arg        USART5_INT_TBE: transmit data register empty interrupt
      \arg        USART5_INT_PERR: parity error interrupt
      \arg        USART5_INT_AM: address match interrupt
      \arg        USART5_INT_RT: receiver timeout interrupt
      \arg        USART5_INT_EB: end of block interrupt
      \arg        USART5_INT_LBD: LIN break detection interrupt
      \arg        USART5_INT_ERR: error interrupt enable in multibuffer communication
      \arg        USART5_INT_WU: wakeup from deep-sleep mode interrupt
      \arg        USART5_INT_RFF: receive FIFO full interrupt enable
    \param[out] none
    \retval     none
*/
void usart5_interrupt_disable(uint32_t usart_periph, usart5_interrupt_enum interrupt)
{
    USART_REG_VAL(usart_periph, interrupt) &= ~BIT(USART_BIT_POS(interrupt));
}

/*!
    \brief      get USART interrupt and flag status
    \param[in]  usart_periph: USART5
    \param[in]  int_flag: interrupt and flag type, refer to usart5_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        USART5_INT_FLAG_EB: end of block interrupt and flag
      \arg        USART5_INT_FLAG_RT: receiver timeout interrupt and flag
      \arg        USART5_INT_FLAG_AM: address match interrupt and flag
      \arg        USART5_INT_FLAG_PERR: parity error interrupt and flag
      \arg        USART5_INT_FLAG_TBE: transmitter buffer empty interrupt and flag
      \arg        USART5_INT_FLAG_TC: transmission complete interrupt and flag
      \arg        USART5_INT_FLAG_RBNE: read data buffer not empty interrupt and flag
      \arg        USART5_INT_FLAG_RBNE_ORERR: read data buffer not empty interrupt and overrun error flag
      \arg        USART5_INT_FLAG_IDLE: IDLE line detected interrupt and flag
      \arg        USART5_INT_FLAG_LBD: LIN break detected interrupt and flag
      \arg        USART5_INT_FLAG_WU: wakeup from deep-sleep mode interrupt and flag
      \arg        USART5_INT_FLAG_ERR_NERR: error interrupt and noise error flag
      \arg        USART5_INT_FLAG_ERR_ORERR: error interrupt and overrun error
      \arg        USART5_INT_FLAG_ERR_FERR: error interrupt and frame error flag
      \arg        USART5_INT_FLAG_RFF: receive FIFO full interrupt and flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus usart5_interrupt_flag_get(uint32_t usart_periph, usart5_interrupt_flag_enum int_flag)
{
    uint32_t intenable = 0U, flagstatus = 0U;
    /* get the interrupt enable bit status */
    intenable = (USART_REG_VAL(usart_periph, int_flag) & BIT(USART_BIT_POS(int_flag)));
    /* get the corresponding flag bit status */
    flagstatus = (USART_REG_VAL2(usart_periph, int_flag) & BIT(USART_BIT_POS2(int_flag)));

